Black8Mamba/IMXRT1052_for_fireboard/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_BLUE_LED_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITLEDS_BLUE_LED_GPIO_PIN                                     10U   /*!< GPIO pin number */
#define BOARD_INITLEDS_BLUE_LED_GPIO_PIN_MASK                        (1U << 10U)   /*!< GPIO pin mask */
#define BOARD_INITLEDS_BLUE_LED_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITLEDS_BLUE_LED_PIN                                          10U   /*!< PORT pin number */
#define BOARD_INITLEDS_BLUE_LED_PIN_MASK                             (1U << 10U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLeds(void);

/* GPIO_AD_B0_05 (coord G14), CAN_STBY/BOOT_MODE[1]/Flash_RST/U12[8] */
/* Routed pin properties */
#define BOARD_INITKEYS_CAN_STBY_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITKEYS_CAN_STBY_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITKEYS_CAN_STBY_CHANNEL                                       5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITKEYS_CAN_STBY_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITKEYS_CAN_STBY_GPIO_PIN                                      5U   /*!< GPIO pin number */
#define BOARD_INITKEYS_CAN_STBY_GPIO_PIN_MASK                         (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INITKEYS_CAN_STBY_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITKEYS_CAN_STBY_PIN                                           5U   /*!< PORT pin number */
#define BOARD_INITKEYS_CAN_STBY_PIN_MASK                              (1U << 5U)   /*!< PORT pin mask */

/* WAKEUP (coord L6), SD_PWREN */
/* Routed pin properties */
#define BOARD_INITKEYS_SD_PWREN_PERIPHERAL                                 GPIO5   /*!< Peripheral name */
#define BOARD_INITKEYS_SD_PWREN_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITKEYS_SD_PWREN_CHANNEL                                       0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITKEYS_SD_PWREN_GPIO                                       GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITKEYS_SD_PWREN_GPIO_PIN                                      0U   /*!< GPIO pin number */
#define BOARD_INITKEYS_SD_PWREN_GPIO_PIN_MASK                         (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITKEYS_SD_PWREN_PORT                                       GPIO5   /*!< PORT peripheral base pointer */
#define BOARD_INITKEYS_SD_PWREN_PIN                                           0U   /*!< PORT pin number */
#define BOARD_INITKEYS_SD_PWREN_PIN_MASK                              (1U << 0U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitKeys(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2c1(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC */
/* Routed pin properties */
#define BOARD_INPUTCAP_ENET_MDC_PERIPHERAL                                  GPT2   /*!< Peripheral name */
#define BOARD_INPUTCAP_ENET_MDC_SIGNAL                               gpt_capture   /*!< Signal name */
#define BOARD_INPUTCAP_ENET_MDC_CHANNEL                                       2U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InputCap(void);

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
/* Routed pin properties */
#define BOARD_INITADC_CSI_D6_PERIPHERAL                                     ADC1   /*!< Peripheral name */
#define BOARD_INITADC_CSI_D6_SIGNAL                                           IN   /*!< Signal name */
#define BOARD_INITADC_CSI_D6_CHANNEL                                          0U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAdc(void);

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4] */
/* Routed pin properties */
#define BOARD_INITCAN_CAN2_RX_PERIPHERAL                                    CAN2   /*!< Peripheral name */
#define BOARD_INITCAN_CAN2_RX_SIGNAL                                          RX   /*!< Signal name */

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
/* Routed pin properties */
#define BOARD_INITCAN_CAN2_TX_PERIPHERAL                                    CAN2   /*!< Peripheral name */
#define BOARD_INITCAN_CAN2_TX_SIGNAL                                          TX   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCan(void);

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D0_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D1_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D1_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D2_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D2_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D3_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D3_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D3_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D4_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D4_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D4_CHANNEL                                       4U   /*!< Signal channel */

